---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyle.FontVerticalAlignment
source: html/7cb745c7-34d8-197d-6069-f6c388c65ee2.htm
---
# Autodesk.Revit.DB.TableCellStyle.FontVerticalAlignment Property

The vertical alignment style of text font.

## Syntax (C#)
```csharp
public VerticalAlignmentStyle FontVerticalAlignment { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration